#include "ModBus.h"

/*********************************************************************************
*函数名称 : CRC_Modbus
*功能     : 校验CRC
*介绍     :将接收的字节进行计算,要求数据字节要与后两位校验字节一致
*输出     : 输出两字节 
**************************************************************************************/
uint16_t CRC16_Modbus(volatile uint8_t *buf, uint16_t len)
{
    uint16_t crc = 0xFFFF;
    for (uint16_t i = 0; i < len; i++)
    {
        crc ^= buf[i];
        for (uint8_t j = 0; j < 8; j++)
        {
            crc = (crc & 0x0001) ? ((crc >> 1) ^ 0xA001) : (crc >> 1);
        }
    }
    return crc;
}







